import React, { useMemo, useRef, useState } from 'react';

export default function Main() {

    return (
        <div className="main">
            <div className='main-mail'>
                <h1>위키 이용자분들께🙇‍♂️</h1>
                <h3>안녕하세요, 조선말기사육사입니다.</h3>
                <h3>디슈럼 위키는 다양한 정보를 한 곳에서 모아서 볼 수 있으면 좋겠다는 마음에 제작했습니다.</h3>
                <h3>운이 좋게도 많은 분들께서 봐주시고 도와주셔서 위키도 점점 발전해나가고 있습니다.</h3>
                <h3>현재 위키는 무료 호스팅으로 서비스되고 있으며,</h3>
                <h3>이용자분들께서 많이 찾아주시는 만큼 이용량의 증가량 또한 더욱 빠르게 상승중입니다.</h3>
                <h3>따라서 1월까지 사용량을 지켜본 후 유료서버로 전환할 지 결정하려 합니다.</h3>
                <h3>그 일환으로 현재 카카오 Adfit을 신청해둔 상태이며,</h3>
                <h3>광고로 인한 수입으로 서버비를 감당할 수 없는 경우에는 개인후원도 받아볼 생각입니다.</h3>
                <h3>만약 유료서버로 전환하게 된다면 더 많은 기능을 제공해드릴 수 있을 것 같습니다.</h3>
                <h3>현재 추세로 봐서는 당장 1월에는 한도를 넘지는 않을 것 같으나</h3>
                <h3>일일 사용량을 봤을때 한도에 꽤 근접할 것 같아 미리 공지드립니다.</h3>
                <h3>사이트 운영이 처음이라 많이 미숙합니다.</h3>
                <h3>혹여 위 내용 관련해서 도와주실 수 있는 분은</h3>
                <h3>hippo2003@naver.com 으로 연락 한 번 부탁드리겠습니다.</h3>
            </div>
        </div>
    );
}